app/controllers/api/bands_controller.rb

    def index
      @bands = Band.all
---
SELECT `bands`.* FROM `bands`

    def show
      @band = Band.find(params[:id])
---
SELECT `bands`.* FROM `bands` WHERE `bands`.`id` = 1 LIMIT 1

    def create
      @band = Band.new(band_params)
      if @band.save
---
INSERT INTO `bands` (`bandTitle`, `bandContent`, `created_at`, `updated_at`) VALUES ('jj', 'jj', '2021-02-24 13:24:10.912668', '2021-02-24 13:24:10.912668')

    def update
      @band = Band.find(params[:id])
      if @band.update(band_params)
---
SELECT `bands`.* FROM `bands` WHERE `bands`.`id` = 1 LIMIT 1
UPDATE `bands` SET `bands`.`bandContent` = 'Vo :  大竹陸斗(26期)\nGt :  加茂隼人(27期)\nBa : 皆川祐輝(26期)\nDr :  上村武(26期)\n\n一言：ワンオクのコピーやります。', `bands`.`updated_at` = '2021-03-01 05:19:34.878944' WHERE `bands`.`id` = 15

    def destroy
      @band = Band.find(params[:id])
      if @band.destroy
---
SELECT `bands`.* FROM `bands` WHERE `bands`.`id` = 1 LIMIT 1
DELETE FROM `bands` WHERE `bands`.`id` = 1