app/controllers/api/users_controller.rb

    def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO `users` (`username`, `email`, `password`, `created_at`, `updated_at`, `likeBand`, `part`, `message`, `studentId`) VALUES ('yohey', 'm222222@u-aizu.ac.jp', 'hogehoge', '2021-03-04 17:51:24.241026', '2021-03-04 17:51:24.241026', '', '', '', 'm222222')

    def update
      @user = User.find(params[:id])
      if @user.update(user_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
UPDATE `users` SET `users`.`part` = 'Vo', `users`.`likeBand` = 'go!go!vanillas', `users`.`message` = 'よろしくお願いします。', `users`.`updated_at` = '2021-02-20 11:22:17.642518' WHERE `users`.`id` = 4

    def destroy
      @user = User.find(params[:id])
      if @user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1